ИТ_Фирма/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>EMail контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИТ_Фирма/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>EMail</name>
  </enumValues>
  <enumValues>
    <name>Вебсайт</name>
  </enumValues>
</mdclass:Enum>

ИТ_Фирма/src/Catalogs/ВидыКонтактнойИнформации/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес;
	
	ПредопределенныйОбъект = ЮридическийАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = ФактическийАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = ТипАдрес;
	ПредопределенныйОбъект.Записать();	
	
	ПредопределенныйОбъект = ТелефонКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПредопределенныйОбъект.Записать();
	
	ПредопределенныйОбъект = EMailКонтрагента.ПолучитьОбъект();
	ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
	ПредопределенныйОбъект.Записать();
	
КонецПроцедуры
